7767517
188 225
Input                    in0                      0 1 in0
Convolution              conv_2                   1 1 in0 1 0=32 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=864
Swish                    silu_64                  1 1 1 2
Convolution              conv_3                   1 1 2 3 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=18432
Swish                    silu_65                  1 1 3 4
Convolution              conv_4                   1 1 4 5 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Swish                    silu_66                  1 1 5 6
Slice                    split_0                  1 2 6 7 8 -23300=2,32,32 1=0
Split                    splitncnn_0              1 3 8 9 10 11
Convolution              conv_5                   1 1 11 12 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_67                  1 1 12 13
Convolution              conv_6                   1 1 13 14 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_68                  1 1 14 15
BinaryOp                 add_0                    2 1 10 15 16 0=0
Concat                   cat_0                    3 1 7 9 16 17 0=0
Convolution              conv_7                   1 1 17 18 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_69                  1 1 18 19
Split                    splitncnn_1              1 2 19 20 21
Convolution              conv_8                   1 1 21 22 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=73728
Swish                    silu_70                  1 1 22 23
Convolution              conv_9                   1 1 23 24 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=16384
Swish                    silu_71                  1 1 24 25
Slice                    split_1                  1 2 25 26 27 -23300=2,64,64 1=0
Split                    splitncnn_2              1 3 27 28 29 30
Convolution              conv_10                  1 1 30 31 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_72                  1 1 31 32
Convolution              conv_11                  1 1 32 33 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_73                  1 1 33 34
BinaryOp                 add_1                    2 1 29 34 35 0=0
Split                    splitncnn_3              1 3 35 36 37 38
Convolution              conv_12                  1 1 38 39 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_74                  1 1 39 40
Convolution              conv_13                  1 1 40 41 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_75                  1 1 41 42
BinaryOp                 add_2                    2 1 37 42 43 0=0
Concat                   cat_1                    4 1 26 28 36 43 44 0=0
Convolution              conv_14                  1 1 44 45 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_76                  1 1 45 46
Split                    splitncnn_4              1 2 46 47 48
Convolution              conv_15                  1 1 48 49 0=256 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=294912
Swish                    silu_77                  1 1 49 50
Convolution              conv_16                  1 1 50 51 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=65536
Swish                    silu_78                  1 1 51 52
Slice                    split_2                  1 2 52 53 54 -23300=2,128,128 1=0
Split                    splitncnn_5              1 3 54 55 56 57
Convolution              conv_17                  1 1 57 58 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_79                  1 1 58 59
Convolution              conv_18                  1 1 59 60 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_80                  1 1 60 61
BinaryOp                 add_3                    2 1 56 61 62 0=0
Split                    splitncnn_6              1 3 62 63 64 65
Convolution              conv_19                  1 1 65 66 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_81                  1 1 66 67
Convolution              conv_20                  1 1 67 68 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_82                  1 1 68 69
BinaryOp                 add_4                    2 1 64 69 70 0=0
Concat                   cat_2                    4 1 53 55 63 70 71 0=0
Convolution              conv_21                  1 1 71 72 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_83                  1 1 72 73
Convolution              conv_22                  1 1 73 74 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=32768
Swish                    silu_84                  1 1 74 75
Split                    splitncnn_7              1 2 75 76 77
Pooling                  maxpool2d_61             1 1 77 78 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_8              1 2 78 79 80
Pooling                  maxpool2d_62             1 1 80 81 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Split                    splitncnn_9              1 2 81 82 83
Pooling                  maxpool2d_63             1 1 83 84 0=0 1=5 11=5 12=1 13=2 2=1 3=2 5=1
Concat                   cat_3                    4 1 76 79 82 84 85 0=0
Convolution              conv_23                  1 1 85 86 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=131072
Swish                    silu_85                  1 1 86 87
Split                    splitncnn_10             1 2 87 88 89
Interp                   upsample_116             1 1 89 90 0=1 1=2.0 2=2.0 6=0
Concat                   cat_4                    2 1 90 47 91 0=0
Convolution              conv_24                  1 1 91 92 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=49152
Swish                    silu_86                  1 1 92 93
Slice                    split_3                  1 2 93 94 95 -23300=2,64,64 1=0
Split                    splitncnn_11             1 2 95 96 97
Convolution              conv_25                  1 1 97 98 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_87                  1 1 98 99
Convolution              conv_26                  1 1 99 100 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_88                  1 1 100 101
Concat                   cat_5                    3 1 94 96 101 102 0=0
Convolution              conv_27                  1 1 102 103 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_89                  1 1 103 104
Split                    splitncnn_12             1 2 104 105 106
Interp                   upsample_117             1 1 106 107 0=1 1=2.0 2=2.0 6=0
Concat                   cat_6                    2 1 107 20 108 0=0
Convolution              conv_28                  1 1 108 109 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=12288
Swish                    silu_90                  1 1 109 110
Slice                    split_4                  1 2 110 111 112 -23300=2,32,32 1=0
Split                    splitncnn_13             1 2 112 113 114
Convolution              conv_29                  1 1 114 115 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_91                  1 1 115 116
Convolution              conv_30                  1 1 116 117 0=32 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=9216
Swish                    silu_92                  1 1 117 118
Concat                   cat_7                    3 1 111 113 118 119 0=0
Convolution              conv_31                  1 1 119 120 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=6144
Swish                    silu_93                  1 1 120 121
Split                    splitncnn_14             1 3 121 122 123 124
Convolution              conv_32                  1 1 124 125 0=64 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=36864
Swish                    silu_94                  1 1 125 126
Concat                   cat_8                    2 1 126 105 127 0=0
Convolution              conv_33                  1 1 127 128 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_95                  1 1 128 129
Slice                    split_5                  1 2 129 130 131 -23300=2,64,64 1=0
Split                    splitncnn_15             1 2 131 132 133
Convolution              conv_34                  1 1 133 134 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_96                  1 1 134 135
Convolution              conv_35                  1 1 135 136 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_97                  1 1 136 137
Concat                   cat_9                    3 1 130 132 137 138 0=0
Convolution              conv_36                  1 1 138 139 0=128 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=24576
Swish                    silu_98                  1 1 139 140
Split                    splitncnn_16             1 3 140 141 142 143
Convolution              conv_37                  1 1 143 144 0=128 1=3 11=3 12=1 13=2 14=1 2=1 3=2 4=1 5=1 6=147456
Swish                    silu_99                  1 1 144 145
Concat                   cat_10                   2 1 145 88 146 0=0
Convolution              conv_38                  1 1 146 147 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_100                 1 1 147 148
Slice                    split_6                  1 2 148 149 150 -23300=2,128,128 1=0
Split                    splitncnn_17             1 2 150 151 152
Convolution              conv_39                  1 1 152 153 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_101                 1 1 153 154
Convolution              conv_40                  1 1 154 155 0=128 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_102                 1 1 155 156
Concat                   cat_11                   3 1 149 151 156 157 0=0
Convolution              conv_41                  1 1 157 158 0=256 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=98304
Swish                    silu_103                 1 1 158 159
Split                    splitncnn_18             1 2 159 160 161
MemoryData               pnnx_88                  0 1 162 0=33600
Convolution              conv_42                  1 1 123 163 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_104                 1 1 163 164
Convolution              conv_43                  1 1 164 165 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_105                 1 1 165 166
Convolution              conv_44                  1 1 166 167 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_118              1 1 167 168 0=25600 1=64
Convolution              conv_45                  1 1 142 169 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_106                 1 1 169 170
Convolution              conv_46                  1 1 170 171 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_107                 1 1 171 172
Convolution              conv_47                  1 1 172 173 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_119              1 1 173 174 0=6400 1=64
Convolution              conv_48                  1 1 161 175 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_108                 1 1 175 176
Convolution              conv_49                  1 1 176 177 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_109                 1 1 177 178
Convolution              conv_50                  1 1 178 179 0=64 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=4096
Reshape                  reshape_120              1 1 179 180 0=1600 1=64
Concat                   cat_12                   3 1 168 174 180 181 0=1
Convolution              conv_51                  1 1 122 182 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_110                 1 1 182 183
Convolution              conv_52                  1 1 183 184 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_111                 1 1 184 185
Convolution              conv_53                  1 1 185 186 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_121              1 1 186 187 0=25600 1=1
Convolution              conv_54                  1 1 141 188 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=73728
Swish                    silu_112                 1 1 188 189
Convolution              conv_55                  1 1 189 190 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_113                 1 1 190 191
Convolution              conv_56                  1 1 191 192 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_122              1 1 192 193 0=6400 1=1
Convolution              conv_57                  1 1 160 194 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=147456
Swish                    silu_114                 1 1 194 195
Convolution              conv_58                  1 1 195 196 0=64 1=3 11=3 12=1 13=1 14=1 2=1 3=1 4=1 5=1 6=36864
Swish                    silu_115                 1 1 196 197
Convolution              conv_59                  1 1 197 198 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=1 6=64
Reshape                  reshape_123              1 1 198 199 0=1600 1=1
Concat                   cat_13                   3 1 187 193 199 200 0=1
Reshape                  reshape_124              1 1 181 201 0=33600 1=16 2=4
Permute                  transpose_127            1 1 201 202 0=2
Softmax                  softmax_1                1 1 202 203 0=0 1=1
Convolution              conv_60                  1 1 203 204 0=1 1=1 11=1 12=1 13=1 14=0 2=1 3=1 4=0 5=0 6=16
Reshape                  reshape_125              1 1 204 205 0=33600 1=4
MemoryData               pnnx_fold_anchor_points.1 0 1 206 0=33600 1=2
Split                    splitncnn_0              1 2 206 207 208
Slice                    chunk_0                  1 2 205 209 210 -23300=2,-233,-233 1=0
BinaryOp                 sub_5                    2 1 207 209 211 0=1
Split                    splitncnn_19             1 2 211 212 213
BinaryOp                 add_6                    2 1 208 210 214 0=0
Split                    splitncnn_20             1 2 214 215 216
BinaryOp                 add_7                    2 1 212 215 217 0=0
BinaryOp                 div_8                    1 1 217 218 0=3 1=1 2=2.0
BinaryOp                 sub_9                    2 1 216 213 219 0=1
Concat                   cat_14                   2 1 218 219 220 0=0
Reshape                  reshape_126              1 1 162 221 0=33600 1=1
BinaryOp                 mul_10                   2 1 220 221 222 0=2
Sigmoid                  sigmoid_0                1 1 200 223
Concat                   cat_15                   2 1 222 223 out0 0=0
